Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: One of these options MUST be used.
ja: これらのオプションの1つが利用されなければならない.

source: The client SHOULD put any modes it knows about in the stream, and the server MAY ignore any modes it does not know about.
ja: クラアイントは, 知っているすべてのモードをストリームに加える必要がある. サーバは, 知らないモードを無視してもよい.

source: If the attempt to establish a connection is unsuccessful or if server-authentication fails, then snmpSshtmSessionOpenErrors is incremented, an openSession error indication is returned, and openSession processing stops.
ja: 接続の確立に失敗したりサーバ認証に失敗したら, snmpSshtmSessionOpenErrors がインクリメントされ, openSession エラー表示が返され, openSession の処理が停止する.

source: Otherwise, it MUST send the empty string.
ja: そうでなければ, 空文字列を送らなければならない.

source: At the time of this writing, many implementations of SSH are utilizing protocol version 2.0, but it is known that there are still devices using the previous versions.
ja: 執筆時点では, SSHの多くの実装が プロトコルバージョン 2.0 を利用しているが, まだ以前のバージョンを利用するデバイスも存在している.

source: Operational Considerations .....................................29 9.
ja: 運用上の考察 .....................................29 9.

source: Pseudo-Terminal Encoded Terminal Modes
ja: 擬似ターミナルの Encoded Terminal Modes

source: + the server also supports the algorithm,
ja: + サーバもそのアルゴリズムをサポートしている.

source: Status Codes
ja: 状態コード

source: 192 to 255 Local extensions
ja: 192 to 255 ローカルな拡張

source: Some systems may not implement signals, in which case they SHOULD ignore this message.
ja: シグナルを実装していないシステムの場合は, このメッセージは無視される必要がある.

source: The SSH Transport Model should work with any of the ssh-userauth methods, including the "publickey", "password", "hostbased", "none", "keyboard-interactive", "gssapi-with-mic", ."gssapi-keyex", "gssapi", and "external-keyx" (see the SSH Protocol Parameters registry maintained by IANA).
ja: SSH のトランスポートモデルは, "publickey" や "password", "hostbased", "none", "keyboard-interactive", "gssapi-with-mic", ."gssapi-keyex", "gssapi","external-keyx" を含む ssh-userauth の方法のどれとでも動作する. ( IANA が管理する SSH プロトコルパラメータレジストリを参照)

source: In this, C is the client; S is the server; p is a large safe prime; g is a generator for a subgroup of GF(p); q is the order of the subgroup; V_S is S's identification string; V_C is C's identification string; K_S is S's public host key; I_C is C's SSH_MSG_KEXINIT message and I_S is S's SSH_MSG_KEXINIT message that have been exchanged before this part begins.
ja: ここで, C はクライアント; S はサーバ; p は大きく安全な素数; g は GF(p) 部分群の生成子; q は部分群のオーダー; V_S は S の識別文字列; V_C は C の識別文字列; K_S は S のホスト公開鍵; I_C は C の SSH_MSG_KEXINIT メッセージ; I_S は, この処理が始まる前に交換される S の SSH_MSG_KEXINIT メッセージだ.

source: From an internationalization standpoint, it is desired that if a user enters responses, the authentication process will work regardless of what OS and client software they are using.
ja: 国際化の観点から, ユーザが応答を入力する際, 認証のプロセスはユーザが用いるOSやクライアントソフトウェアに関係なく動くことが望ましい.

source: Additionally, implementers should be aware of security considerations specific to elliptic curve cryptography.
ja: さらに, 実装者は楕円曲線暗号に特有のセキュリティの考察に注意する必要がある.

source: Transport
ja: トランスポート

source: The client should invoke the "ssh-connection" service (also known as the SSH connection protocol [RFC4254]), and request a channel of type "session".
ja: クライアントは, "ssh-connection" サービス (SSH コネクションプロトコル [RFC4254] としても知られる) を起動し, "session" タイプのチャンネルを要求する.

source: This call is made exactly as described above.
ja: この呼び出しは, 前述の通りに行なわれる.

source: In such a configuration, the server implementation supports the "ssh-dss" key algorithm (as required by [SSH-TRANSPORT]), but could be prohibited by configuration from using it.
ja: このような設定では, サーバの実装は "ssh-dss" 鍵アルゴリズムをサポートしている ([SSH-TRANSPORT] で要求されている). しかし, 設定で利用を禁止できる.

source: The IANA has assigned the Encryption Algorithm Names "arcfour128" and "arcfour256" in accordance with [RFC4250].
ja: IANA は 暗号アルゴリズム名(Encryption Algorithm Names) に "arcfour128" と "arcfour256" を [RFC4250] に従って割り当てた.

source: Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI).
ja: MIBのオブジェクトは, Structure of Management Informantion (SMI) で定義されたメカニズムを用いて定義される.

source: Data Integrity ............................................12 6.5.
ja: データの完全性........................................12 6.5.

source: The protocol can be used as a basis for a number of secure network services.
ja: このプロトコルは, 多くの安全なネットワークサービスのための基盤として使うことができる.

source: Each name-list MUST contain at least one algorithm name.
ja: それぞれの名前リストは, 少なくとも1つのアルゴリズム名を含まなければならない.

source: Details
ja: 詳細

source: Note that the hash used in key exchange (in this case, SHA-256) must also be used in the key derivation pseudo-random function (PRF), as per the requirement in the "Output from Key Exchange" section in [RFC4253].
ja: 鍵交換で利用されるハッシュ(この場合 SHA-256)は, 鍵導出疑似乱数関数(PRF)でも用いられなければならない. これは, [RFC4253]の「鍵交換からの出力」での要件によるものだ.

source: SSH ECC Public Key Algorithm ....................................4 3.1.
ja: SSH 楕円曲線暗号公開鍵アルゴリズム .....................................4 3.1.

source: Key Exchange
ja: 鍵交換

source: Signature Algorithm
ja: 署名アルゴリズム

source: o MUST NOT generate data packets larger than its transport layer is willing to send, even if the remote end would be willing to accept very large packets.
ja: o トランスポート層が送れるものよりも大きな data packet を生成してはならない. たとえ, リモート側が非常に大きな packet を受けとりたい場合でもだ.

source: SSH Terminology ............................................3 1.2.
ja: SSH の用語 ............................................3 1.2.

source: For the sake of brevity, ECDSA-256 will be used to denote ECDSA on P-256 using SHA-256, and ECDSA-384 will be used to denote ECDSA on P-384 using SHA-384.
ja: 簡潔にするため, SHA-256 を用いる P-256 上の ECDSA を示すのに ECDSA-256 を利用する. また, SHA-384 を用いる P-384 上の ECDSA を示すのに ECDSA-384 を利用する.

source: The SSH transport layer is a secure, low level transport protocol.
ja: SSH トランスポート層は, 安全で低レベルなトランスポートプロトコルだ.

source: o Verifiers MUST be prepared to receive certificate chains and OCSP responses that use algorithms not listed in the server_host_key_algorithms field of the SSH_MSG_KEXINIT packet, including algorithms that potentially have no Secure Shell
ja: o 検証者は, セキュアシェルに同等なものがないアルゴリズムも含めて, SSH_MSG_KEXINIT パケットの server_host_key_algorithms フィールドに挙がっていないアルゴリズムを用いた 証明書チェーンや OCSP 応答を受けとる準備をしなければならない.

source: This document defines the instructions to the IANA and the initial state of the IANA assigned numbers for the Secure Shell (SSH) protocol.
ja: この文書は, セキュアシェル(SSH)プロトコルについてのIANAへの指示とIANAで割当てられる番号の初期状態を定義する.

source: Note that the length of the concatenation of 'packet_length', 'padding_length', 'payload', and 'random padding' MUST be a multiple of the cipher block size or 8, whichever is larger.
ja: 'packet_length', 'padding_length', 'payload', 'random padding を連結した長さが, 暗号のブロックサイズか8のどちらか大きいほうの倍数になっていなければならないことに注意.

source: Similarly for the other characters.
ja: 他の文字についても同様.

source: C is also allowed to accept the key without verification; however, doing so will render the protocol insecure against active attacks (but may be desirable for practical reasons in the short term in many environments).
ja: C は, 鍵を検証無しで受け入れることもできる; しかし, そうするとプロトコルを能動的な攻撃に対して安全ではなくしてしまう (しかし, 多くの環境で短い期間実際的な理由から望まれている).

source: The server implementation MUST carefully check them in every message, and MUST flush any accumulated authentication states if they change.
ja: サーバの実装は, すべてのメッセージを注意深く検査しなければならない. もし変更されていたら蓄積した認証の状態を消去しなければならない.

source: If 'client can do' is TRUE, the client is allowed to do flow control using control-S and control-Q.
ja: 'client can do' が TRUEなら, クライアントは, control-S と control-Q を用いてフロー制御できる.

source: Notifications and Proxy ...................................12 4.
ja: 通知とプロキシ ...................................12 4.

source: Future Assignments of Names ........................13 4.7.
ja: 名前の将来の割り当て........................13 4.7.

source: If the requested 'user name' does not exist, the server MAY disconnect, or MAY send a bogus list of acceptable authentication 'method name' values, but never accept any.
ja: 要求された'user_name'が存在しない場合, サーバは切断してもよいし, 'method_name'の値に受け入れられる認証のニセのリスト(しかし実際には受け入れない)を送ってもよい.

source: For example, if a channel is proposed with a 'channel type' of "example_session@example.com", but fails, then the response will contain either a 'reason code' assigned by the IANA (as listed above and in the range of 0x00000001 to 0xFDFFFFFF) or a locally assigned value in the range of 0xFE000000 to 0xFEFFFFFF.
ja: たとえば,"example_session@example.com" という 'channel type' のチャンネルが提案されたが失敗したとき, レスポンスには, (前述ないし0x00000001 から 0xFDFFFFFFの範囲の) IANA で割り当てられた 'reason code'が含まれるか, 0xFE000000 から 0xFEFFFFFF の埴のローカルに割り当てられた値を'reason code' が含まれる.

source: The targets to whom notifications or proxy requests should be sent is typically determined and configured by a network administrator.
ja: 通知やプロキシのリクエストが送られるべきターゲットは, ネットワークの管理者によって典型的に決定され設定される.

source: If both sides make the same guess, that algorithm MUST be used.
ja: もし, 両方の側が同じ推測をしていたら, そのアルゴリズムが使われなければならない.

source: Requirements Terminology .
ja: 要件に関する用語 .

source: Note also that cryptography often plays only a small (but critical) role in an application's overall security.
ja: 注意: アプリケーション全体のセキュリティでは, 暗号はしばしば小さい(しかし重大な)役割のみを果している.

source: This is consistent with the IESG decision to not require the SNMPv3 terminology be modified to match the usage of other non-SNMP specifications when SNMPv3 was advanced to Full Standard.
ja: SNMPv3 が完全な標準になる際に SNMP でない仕様の用法と一致するよう SNMPv3の用語を変更するのを求めないというと一貫している.

source: Data confidentiality and data integrity protection to the server still exist, but these are of dubious value when an attacker can insert himself between the client and the real SSH server.
ja: サーバへのデータの機密性とデータの完全性保護は残るが, 攻撃者が自身をクライアントと本当のサーバに挿入できる場合, これらは怪しい.

source: Thus, the setting of replay_det_req_flag and sequence_req_flag are not needed for this process.
ja: このため, replay_det_req_flag と sequence_req_flag はこのプロセスでは設定する必要がない.

source: This attribute SHOULD be critical.
ja: この属性は critical にする必要がある.

source: A command line interface (CLI) client SHOULD print the name and instruction (if non-empty), adding newlines.
ja: コマンドラインインタフェイス (CLI) クライアントは, name と instruction (空文字列でなかったら) を表示し, 改行を追加する.

source: On the SSH server side of a connection:
ja: 接続のSSHサーバ側では：

source: + if the algorithm requires a signature-capable host key, there is a signature-capable algorithm on the server's server_host_key_algorithms that is also supported by the client.
ja: + もしアルゴリズムが署名可能なホスト鍵を必要とするなら, クライアントとサーバ双方の server_host_key_algorithms に挙げられた署名可能なアルゴリズムである.

source: Normal precautions MUST be taken to prevent the execution of unauthorized commands.
ja: 権限のないコマンドの実行を防止する, 通常の予防措置が取られなければならない.

source: S calls GSS_Accept_sec_context(), using the token received from C.
ja: S は, Cから受け取ったトークンを用いて GSS_Accept_sec_context() を呼ぶ.

source: The first 1536 bytes of keystream generated by the cipher MUST be discarded, and the first byte of the first encrypted packet MUST be encrypted using the 1537th byte of keystream.
ja: 暗号から生成される鍵ストリームの最初の1536バイトは破棄されなければならない. 最初の暗号化されたパケットの最初のバイトは, 鍵ストリームの1537番目のバイトで暗号化されなければならない.

source: The key file header section consists of multiple RFC822-style header fields.
ja: 鍵ファイルのヘッダ部は, 複数の RFC822 スタイルのヘッダフィールドから構成される.

source: Upon receiving the SSH_MSG_KEXGSS_INIT message, the server MAY send the following message, prior to any other messages, to inform the client of its host key.
ja: この SSH_MSG_KEXGSS_INIT メッセージを受けとったら, サーバは, ホスト鍵をクライアントに知らせるために, 他のメッセージより前に次のメッセージを送ってもよい.

source: User Interface
ja: ユーザインタフェース

source: SSH employs an asymmetric cryptography and naming model.
ja: SSH は 非対称な暗号と命名モデルを採用している.

source: The SSH binary packet structure is independent of any packet structure on the underlying data channel.
ja: SSH バイナリパケット構造は, 基底のデータチャンネルのパケットの構造から独立だ.

source: Outputs: octet_string CT; // Cipher Text octet_string AT; // Authentication Tag
ja: Outputs: octet_string CT; // 暗号文 octet_string AT; // 認証タグ

source: This may be accompanied by the requested securityLevel and the tmStateReference.
ja: これは, 要求される securityLevel と tmStateReference を伴なう可能性がある.

source: Public Key Algorithms Using X.509 Version 3 Certificates
ja: X.509 バージョン 3 証明書を用いる公開鍵アルゴリズム

source: "agent" specifies that session channel "auth-agent-req" requests should be denied when this key is in use.
ja: "agent" は, この鍵を用いるとセッションチャンネルの "auth-agent-req" 要求が拒否されることを指定する.

source: PT (Plain Text) byte padding_length; // 4 <= padding_length < 256 byte[n1] payload; // n1 = packet_length-padding_length-1 byte[n2] random_padding; // n2 = padding_length AAD (Additional Authenticated Data) uint32 packet_length; // 0 <= packet_length < 2^32 IV (Initialization Vector) As described in section 7.1.
ja: PT (Plain Text) byte padding_length; // 4 <= padding_length < 256 byte[n1] payload; // n1 = packet_length-padding_length-1 byte[n2] random_padding; // n2 = padding_length AAD (Additional Authenticated Data) uint32 packet_length; // 0 <= packet_length < 2^32 IV (Initialization Vector) 7.1節で 記述したもの.

source: Other methods may also be found and implemented.
ja: 他の方法も発見され実装されるかもしれない.

source: Connection Protocol Channel Request Names
ja: コネクションプロトコルのチャンネルのリクエスト名

source: This vulnerability can be mitigated by using an alternative form of authentication.
ja: この弱点は, 別の認証法を利用することで緩和できる.

source: Secure Shell (SSH) is a protocol for secure remote login and other secure network services over an insecure network.
ja: セキュアシェル (SSH) は, 安全ではないネットワーク上での安全なリモートログインや他の安全なネットワークサービスのためのプロトコルだ.

source: The "twofish128-ctr" method uses Twofish with 128-bit keys [TWOFISH].
ja: "twofish128-ctr" は 128-bit 鍵を用いる Twofish を使う [TWOFISH].

source: This section describes this and encourages administrators
ja: この節では, この点を詳述し, セッションを始める前にこの関係を検証することの重要性を管理者とユーザが理解するように勧めている.

source: The design of this SNMP Transport Model is influenced by the following constraints:
ja: この SNMP トランスポートモデルの設計は, 以下の製薬に影響されている.

source: The "serpent192-cbc" cipher is the same as above, but with a 192-bit key.
ja: "serpent192-cbc" 暗号は, 同様の暗号だが, 192-bit の鍵を使う.

source: Both parties MAY ignore this name-list.
ja: どちらの側もこの名前リストを無視してよい.

source: The IANA will not register, and will not control, names with the at-sign in them.
ja: IANAは, アットマークを含む名前を登録しないし管理しない.

source: Summary of Message Numbers .....................................21 7.
ja: メッセージ番号のまとめ .....................................21 7.

source: Currently, the following names have been reserved:
ja: 現在, 次の名前が予約されている:

source: If an SSH implementation uses a block cipher with a larger block size (e.g., Rijndael with 256-bit blocks), then the recommendations in Section 3.1 may supersede the recommendations in this subsection (depending on the lengths of the packets).
ja: SSHの実装が より大きなブロックサイズのブロック暗号(例えば 256-bitブロックのRijndael) を利用する場合, 3.1節の推奨がこの節の推奨を上書きするかもしれない(パケットの長さに依存する).

source: o Service Names * Authentication Methods * Connection Protocol Channel Names * Connection Protocol Global Request Names * Connection Protocol Channel Request Names
ja: o サービスの名前 * 認証法 * コネクションプロトコルのチャンネル名 * コネクションプロトコルのグローバルなリクエスト名 * コネクションプロトコルのチャンネルリクエスト名

source: Some functionality (e.g., password authentication) may be disabled for security reasons if this cipher is chosen.
ja: この暗号を用いる場合は, いくつかの機能(たとえば, パスワード認証)がセキュリティ上の理由から無効にされるだろう.

source: o Anyone can define additional algorithms or methods by using names in the format name@domainname, e.g., "ourcipher-cbc@example.com".
ja: o name@domainname という形式の名前を用いて, だれでも追加のアルゴリズムや方式を定義できる. たとえば, "ourcipher-cbc@example.com".

source: Multiple hosts MAY share the same host key.
ja: 複数のサーバで同じホスト鍵を共有してもよい.

source: 128 to 191 Reserved
ja: 128 to 191 予約

source: The binary packet is the concatenation of the 4-octet packet_length, the cipher text (CT), and the 16-octet authentication tag (AT).
ja: バイナリパケットは, 4オクテットの 4-octet packet_length と cipher text (CT, 暗号テキスト), 16-オクテットの authentication tag (AT, 認証タグ) を連結したものだ.

source: Full security considerations for this protocol are provided in [SSH-ARCH].
ja: このプロトコルのセキュリティについての考慮のすべては, [SSH-ARCH]で提供されている.

source: There are several kinds of requests that affect the state of the remote end globally, independent of any channels.
ja: リモートの状態に全体的に(チャンネルとは独立に)影響する要求がいくつかある.

source: o Added examples to show new chunked encoding properly; highlighted the location of new lines.
ja: o 新しいチャンクされたエンコーディングを適切に示す例を追加した; 改行の位置を強調した.

source: For example, initialization vectors SHOULD be passed from the end of one packet to the beginning of the next packet.
ja: たとえば, 初期化ベクトルは, パケットの最後から次のパケットの最初へと引き継がれる必要がある.

source: The server may send as many requests as are necessary to authenticate the client; the client MUST be prepared to handle multiple exchanges.
ja: サーバは, クライアントを認証するためにたくさんの要求を必要とするかもしれない. クライアントは複数の交換を処理する準備をしなければならない.

source: There are no initial assignments of the Connection Protocol Subsystem Names.
ja: コネクションプロトコルのサブシステムの名前には初期の割り当てはない.

source: Consistent with Section 8 of [RFC4251] and Section 4.6 of [RFC4250], this document makes the following registrations:
ja: [RFC4251] の 8節と [RFC4250] の4.6節と整合するため, この文書は次の登録を行なう.

source: The invocation field is treated as a 64-bit integer and is incremented after each invocation of AES-GCM to process a binary packet.
ja: 呼び出しフィールドは, 64-ビットの整数として扱われ, バイナリパケットを処理する AES-GCM の呼び出しの後でインクリメントされる.

source: The Secure Shell Protocol .......................................7 3.
ja: セキュアシェルプロトコル .......................................7 3.

source: The use of multiple moduli inhibits a determined attacker from precalculating moduli exchange values, and discourages dedication of resources for analysis of any particular modulus.
ja: 複数の法(moduli)を利用すると, 特定の攻撃者が法の交換の値の事前計算することを抑制し, 特定の法の分析に専念できなくさせる.

source: The contents of each binary packet and portions of the header are encrypted, and each packet is authenticated with its own message authentication code.
ja: 各バイナリパケットの内容とそのヘッダの一部は暗号化され, それぞれのパケットは独自のメッセージ認証コードで認証される.

source: Application developers should take this into account when displaying these messages.
ja: これらのメッセージを表示するアプリケーション開発者は, 複数行あるかもしれないことに注意しなければならない.

source: Before closing the subsystem, a status message with the status SSH_PUBLICKEY_VERSION_NOT_SUPPORTED SHOULD be sent.
ja: サブシステムを終了する前に,状態が SSH_PUBLICKEY_VERSION_NOT_SUPPORTED な状態メッセージを送る必要がある.

source: The reason that the MAC will fail is because the receiver will formulate a MAC based upon the packet contents, the shared secret, and the expected sequence number.
ja: MACが失敗する理由は, パケットの内容と共有の秘密, さらに期待されるシーケンス番号によって受け取り手がMACを編成するからだ.

source: In this situation, the server needs some key exchange algorithm to advertise; the "null" algorithm fills this purpose.
ja: このときサーバはクライアントに告知する鍵交換アルゴリズムが必要だ. "null" アルゴリムはこの目的を満す.

source: When compatibility with old clients is not needed, the server MAY send its initial key exchange data immediately after the identification string.
ja: 古いクライアントとの互換性が不要なら, サーバは識別文字列の後ですぐに初期の鍵交換のデータを送ってもよい.

source: Initial Assignments .................................6 4.1.3.
ja: 初期の割り当て .................................6 4.1.3.

source: Implementers of the X11 forwarding protocol SHOULD implement the magic cookie access-checking spoofing mechanism, as described in [SSH-CONNECT], as an additional mechanism to prevent unauthorized use of the proxy.
ja: X11転送プロトコルの実装者は, magic cookieのアクセスチェックをなりすますメカニズム ([SSH-CONNECT]に記述されている) を実装する必要がある. これは, プロキシの不正な利用を防止する追加のメカニズムだ.

source: This makes it possible for the server to avoid disclosing information on which accounts exist.
ja: これによって, サーバが, アカウントが存在するかの情報を漏らすのを避けることができる.

source: To decrypt a ciphertext C=C1||C2||...||Cn, the decryptor (who also maintains its own copy of X) first encrypts its copy of <X> with <cipher> to generate a block B1 and then XORs B1 to C1 to get P1.
ja: 暗号文 C=C1||C2||...||Cn を復号するには, (やはりXのコピーを自身で管理している)復号器が <X>のコピーを <cipher>で暗号化し ブロック B1 を生成し, B1 と C1 を XOR して P1を得る.

source: In particular, it specifies Elliptic Curve Diffie-Hellman (ECDH) key agreement, Elliptic Curve Menezes-Qu-Vanstone (ECMQV) key agreement, and Elliptic Curve Digital Signature Algorithm (ECDSA) for use in the SSH Transport Layer protocol.
ja: 特に, 楕円曲線 Diffie-Hellman (ECDH) 鍵交換(鍵同意) と 楕円曲線 Menezes-Qu-Vanstone (ECMQV) 鍵交換(鍵同意), 楕円曲線 Digital Signature Algorithm (ECDSA) を SSHトランスポート層プロトコルで利用するために仕様を定める.

source: As such, applications that write them must be prepared for handling errors if such values are not supported or cannot be resolved (if resolution occurs at the time of the management operation).
ja: このため, この値を書き込むアプリケーションは, これらの値がサポートされていなかったり(管理の運用時に解決が発生する場合に)解決されない場合のエラーを処理する準備がされていなければならない.

source: For interoperability reasons, as few fingerprint types as possible should be reserved.
ja: 相互運用性のため, 予約される指紋のタイプは可能な限り少なくする必要がある.

source: Using the above example, possible values for 'data' are "foo" and "bar".
ja: 上の例を用いると, 'data' の取り得る値には, "foo" や "bar" がある.

source: The family of SSH key exchange method names beginning with "gss- group1-sha1-" and not containing the at-sign ('@'), to name the key exchange methods defined in Section 2.3.
ja: "gss-group1-sha1-" で始まり アットマーク('@')を含まないSSH 鍵交換法名のファミリで 2.3節で定義した鍵交換法を指定する.

source: They use a chain of signatures by a trusted root certification authority and its intermediate certificate authorities to bind a given public signing key to a given digital identity.
ja: これらの環境では, 信頼できるルート認証機関による署名の連鎖と公開署名鍵と電子IDを束縛する中間認証局を用いる.

source: The server sends:
ja: サーバは以下を送る:

source: The exchange then proceeds as described in Section 2.1 above.
ja: そして交換は， 2.1節で前述したように進行する．

source: If SSHFP is checked first, new SSH host keys may be distributed by replacing the corresponding SSHFP in DNS.
ja: SSHFP が最初に検査されるなら, 新しいSSHホスト鍵は, DNS上の関連する SSHFP を置き換えることで配布されるだろう.

source: All 'encoded terminal modes' (as passed in a pty request) are encoded into a byte stream.
ja: (ptyの要求で渡される)すべての 'encoded terminal modes' は, バイトストリームへエンコードされている.

source: Authentication Requests .........................................4 5.1.
ja: 認証の要求......................................4 5.1.

source: S receives e.
ja: S は e を受け取る.

source: However, other algorithms MAY be used.
ja: しかし, 他のアルゴリズムが利用されるかもしれない.

source: Elliptic Curve Algorithm Integration in the Secure Shell Transport Layer
ja: SSH トランスポート層での楕円曲線アルゴリズムの統合

source: [RFC5480] and [RFC5758] describe the structure of X.509v3 certificates to be used with Elliptic Curve Digital Signature Algorithm (ECDSA) public keys.
ja: [RFC5480] と [RFC5758] は, 楕円曲線デジタル署名アルゴリズム （ＥＣＤＳＡ) 公開鍵で利用する X.509v3 証明書の構造を記述している.

source: Client Server ------ ------ TCP(seq=x, len=500) ----> contains SSH_MSG_IGNORE
ja: Client Server ------ ------ TCP(seq=x, len=500) ----> SSH_MSG_IGNORE を含む

source: Note that if the server has already sent SSH_MSG_USERAUTH_PASSWD_CHANGEREQ, we know that it supports changing the password.
ja: もしサーバが SSH_MSG_USERAUTH_PASSWD_CHANGEREQ を送っていたら, サーバはパスワードの変更をサポートしているとみなされることを注記しておく.

source: This document describes new encryption methods for use with the SSH Transport Protocol.
ja: この文書は, SSHトランスポートプロトコルで利用する新しい暗号法を記述する.

source: The beginning of the address specification may contain a user name followed by an '@' (US-ASCII character 0x40).
ja: このアドレス指定の最初に, '@' (US-ASCII 文字 0x40) が後に続くユーザ名を含めることができる.

source: Key File Header
ja: 鍵ファイルのヘッダ

source: + If openSession succeeds, then record the destTransportDomain, destTransportAddress, tmSecurityname, and tmSessionID in an implementation-dependent manner.
ja: + openSession が成功したら, destTransportDomain, destTransportAddress, tmSecurityname, tmSessionID を実装依存の形式で記録する.

source: o "localhost" means to listen on all protocol families supported by the SSH implementation on loopback addresses only ([RFC3330] and [RFC3513]).
ja: o "localhost" は, SSHの実装がサポートするすべてのプロトコルファミリでループバックのアドレスでだけ受け入れることを意味する. ([RFC3330] and [RFC3513]).

source: This form of authentication is OPTIONAL.
ja: この認証法は選択できる.

source: The following 'method name' values are defined.
ja: 次の 'method name' の値が定義されている.
